package kr.gudi.test.biz;

public class 성적관리 implements I성적관리 {
	/************************************************
	 * >>> 학생정보 데이터 구조
	 * 1) 학생목록 구성 : 배열 (대상 : 학생정보가져오기.학생정보목록 )
	 *  > 학생정보 : 학생 클래스 (bean object)
	 *                 
	 * 2) 학생 클래스 구성 (대상 : kr.gudi.test.bean.학생)
	 *  > 번호 : 정수형 데이터 (get,set)
	 *  > 이름 : 문자열 데이터 (get,set)
	 *  > 성적 : 성적표 클래스 (bean object)
	 *  
	 * 3) 성적표 클래스 구성 (대상 : kr.gudi.test.bean.성적표)
	 *  > 국어 : 정수형 데이터 (get,set)
	 *  > 영어 : 정수형 데이터 (get,set)
	 *  > 수학 : 정수형 데이터 (get,set)
	 *  > 과학 : 정수형 데이터 (get,set)
	 ************************************************/	

	/************************************************
	 * 평균 조건
	 * >> 과목별 성적 평균 출력할것
	 ************************************************/
	public void 평균() {
		
	}

	/************************************************
	 * 성적순 조건
	 * >> 학생별 성적 평균이 높은 순으로 출력할것
	 ************************************************/
	public void 성적순() {
		
	}

	/************************************************
	 * 우수학생 조건
	 * >> 과정별 성적 우수 학생 3위 출력하기
	 * >> 학생별 성적 우수 과목 1위 출력하기
	 ************************************************/
	public void 우수학생() {
		
	}
}
